const gothic = require('../../tools/gothic');
const getRandomInt = require("../../tools/getRandomInt");

console.log("msn loaded");

let emoji = [
  "🥀",
  "✨",
  "🌟",
  "💫",
  "❤️",
  "👿",
  "💀",
  "☠️",
  "🔮",
  "🍂",
  "🪐⁠",
  "*",
  "⁠☆",
  "✧",
  "🎧",
  "♡",
  "˚·",
  "✮",
  "‧₊",
  "☽",
  "❀",
  "｡˚",
  "♱",
  "⋆⋅☆⋅⋆",
  "💋",
  "˚♡˚"
];

let bonus = [
  "♥️ℒℴνℯ♥️",
  "👁️𝒍𝒐𝒔𝒕 𝒊𝒏 𝒔𝒑𝒂𝒄𝒆..👁️",
  "❀𖤣𖥧𖡼⊱✿⊰𖡼𖥧𖤣❀",
  "✧pink✧",
  "W̯ͤ̾ͣ͝Ḛͭ̉̇͟I̍̅̀̎̊R͉̜̎͡͠D̶͔̭̪̻C̵͉͋̔͞O̖̼ͩ͌͐R͉̜̎͡͠Ḛͭ̉̇͟",
  ".˳·˖✶𓆩𓁺𓆪✶˖·˳..˚⊹. ࣪𓉸 ࣪⊹˚.",
  "{¬ºཀ°}¬",
  "༺𓆩☠︎︎𓆪༻⋆",
  "˗ˏˋ ★ ˎˊ˗"
];

let song = [
  "ℑ'𝔪 𝔞 𝔠𝔯𝔢𝔢𝔭, ℑ'𝔪 𝔞 𝔴𝔢𝔦𝔯𝔡𝔬",
  "ℑ𝔪 𝔫𝔬𝔱 𝘖𝘖ᵒᵒ𝘰𝘰𝘬𝘬𝘢ᵃᵃᵃ𝘢𝘢𝘠𝘠𝘠𝘠𝘺𝘺",
  "𝔲𝔯 𝔩𝔦𝔭𝔰𝔱𝔦𝔠𝓀, 𝔥𝔦𝔰 𝔠𝔬𝔩𝔩𝔞𝔯",
  "𝔘 𝔯 𝔱𝔥𝔢 𝔰𝔪𝔢𝔩𝔩 𝔟4 𝔯𝔞𝔦𝔫",
  "𝔐𝓎 𝔥𝔬𝔭𝔢𝔰 𝔯 𝔰𝔬 𝔥𝔦𝔤𝔥 𝔱𝔥𝔞𝔱 𝔲𝔯 𝓴𝔦𝔰𝔰 𝔪𝔤𝔥𝔱 ☠️𝓴𝔦𝔩𝔩☠️ 𝔪𝔢",
  "𝓦𝔢 𝔞𝔯𝔢 𝔱𝔥𝔢 𝔟𝔯𝔲𝔦𝔰𝔢𝔡 𝔞𝔫𝔡 𝔱𝔥𝔢 𝔱𝔢𝔫𝔡𝔢𝔯",
  "𝓦𝔢 𝔠𝔞𝔫 𝔩𝔦𝔳𝔢 𝔩𝔦𝓀𝔢 𝔍𝔞𝔠𝓀 𝔞𝔫𝔡 𝓢𝔞𝔩𝔩𝓎 𝔦𝔣 𝓎𝔬𝔲 𝔴𝔞𝔫𝔱",
  "ℑ 𝔴𝔞𝔩𝓀 𝔞 𝔩𝔬𝔫𝔢𝔩𝓎 𝔯𝔬𝔞𝔡, 𝔱𝔥𝔢 𝔬𝔫𝔩𝓎 𝔬𝔫𝔢 𝔱𝔥𝔞𝔱 ℑ 𝔥𝔞𝔳𝔢 𝔢𝔳𝔢𝔯 𝓀𝔫𝔬𝔴𝔫",
  "𝓦𝔬𝔲𝔩𝔡 𝓎𝔬𝔲 𝔟𝔢 𝔱𝔥𝔢 𝔰𝔞𝔳𝔦𝔬𝔯 𝔬𝔣 𝔱𝔥𝔢 𝔟𝔯𝔬𝓀𝔢𝔫, 𝔱𝔥𝔢 𝔟𝔢𝔞𝔱𝔢𝔫 𝔞𝔫𝔡 𝔱𝔥𝔢 𝔡𝔞𝔪𝔫𝔢𝔡?",
  "ℑ 𝔰𝔢𝔱𝔱𝔩𝔢 𝔣𝔬𝔯 𝔩𝔬𝔫𝔤 𝔡𝔦𝔰𝔱𝔞𝔫𝔠𝔢 𝔠𝔞𝔩𝔩𝔰, ℑ'𝔪 𝔩𝔬𝔰𝔱 𝔦𝔫 𝔢𝔪𝔭𝔱𝓎 𝔭𝔦𝔩𝔩𝔬𝔴 𝔱𝔞𝔩𝓀 𝔞𝔤𝔞𝔦𝔫",
  "𝓐𝔩𝔩 ℑ 𝔴𝔞𝔫𝔱 𝔱𝔬 𝔟𝔢 𝔦𝔰 𝔟𝔢 𝔪𝔬𝔯𝔢 𝔩𝔦𝓀𝔢 𝔪𝔢 𝔞𝔫𝔡 𝔟𝔢 𝔩𝔢𝔰𝔰 𝔩𝔦𝓀𝔢 𝓎𝔬𝔲",
  "ℑ 𝔥𝔞𝔡 𝔱𝔬 𝔣𝔞𝔩𝔩 𝔱𝔬 𝔩𝔬𝔰𝔢 𝔦𝔱 𝔞𝔩𝔩, 𝔟𝔲𝔱 𝔦𝔫 𝔱𝔥𝔢 𝔢𝔫𝔡 𝔦𝔱 𝔡𝔬𝔢𝔰𝔫'𝔱 𝔢𝔳𝔢𝔫 𝔪𝔞𝔱𝔱𝔢𝔯",
  "ℭ𝔞𝔩𝔩 𝔪𝓎 𝔫𝔞𝔪𝔢 𝔞𝔫𝔡 𝔰𝔞𝔳𝔢 𝔪𝔢 𝔣𝔯𝔬𝔪 𝔱𝔥𝔢 𝔡𝔞𝔯𝓀, 𝔴𝔞𝓀𝔢 𝔪𝔢 𝔲𝔭",
  "𝔐𝓎 𝔣𝔯𝔦𝔢𝔫𝔡𝔰 𝔰𝔞𝓎 ℑ 𝔰𝔥𝔬𝔲𝔩𝔡 𝔞𝔠𝔱 𝔪𝓎 𝔞𝔤𝔢, 𝔴𝔥𝔞𝔱'𝔰 𝔪𝓎 𝔞𝔤𝔢 𝔞𝔤𝔞𝔦𝔫? 𝓦𝔥𝔞𝔱'𝔰 𝔪𝓎 𝔞𝔤𝔢 𝔞𝔤𝔞𝔦𝔫?",
  "ℑ'𝔪 𝔰𝔬 𝔱𝔦𝔯𝔢𝔡 𝔬𝔣 𝔟𝔢𝔦𝔫𝔤 𝔥𝔢𝔯𝔢, 𝔰𝔲𝔭𝔭𝔯𝔢𝔰𝔰𝔢𝔡 𝔟𝓎 𝔞𝔩𝔩 𝔪𝓎 𝔠𝔥𝔦𝔩𝔡𝔦𝔰𝔥 𝔣𝔢𝔞𝔯𝔰",
  "𝔏𝔦𝔱𝔱𝔩𝔢 𝔤𝔦𝔯𝔩, 𝓎𝔬𝔲'𝔯𝔢 𝔦𝔫 𝔱𝔥𝔢 𝔪𝔦𝔡𝔡𝔩𝔢 𝔬𝔣 𝔱𝔥𝔢 𝔯𝔦𝔡𝔢, 𝔢𝔳𝔢𝔯𝓎𝔱𝔥𝔦𝔫𝔤'𝔩𝔩 𝔟𝔢 𝔧𝔲𝔰𝔱 𝔣𝔦𝔫𝔢",
  "ℑ'𝔳𝔢 𝔤𝔬𝔱 𝔞𝔫𝔬𝔱𝔥𝔢𝔯 𝔠𝔬𝔫𝔣𝔢𝔰𝔰𝔦𝔬𝔫 𝔱𝔬 𝔪𝔞𝓀𝔢, ℑ'𝔪 𝓎𝔬𝔲𝔯 𝔣𝔬𝔬𝔩", 
  "ℑ'𝔪 𝔦𝔫 𝔱𝔥𝔢 𝔟𝔲𝔰𝔦𝔫𝔢𝔰𝔰 𝔬𝔣 𝔪𝓎𝔰𝔢𝔯𝓎, 𝔩𝔢𝔱'𝔰 𝔱𝔞𝓀𝔢 𝔦𝔱 𝔣𝔯𝔬𝔪 𝔱𝔥𝔢 𝔱𝔬𝔭!",
  "𝓐𝔫𝔡 ℑ 𝔡𝔬𝔫'𝔱 𝔴𝔞𝔫𝔱 𝔱𝔥𝔢 𝔴𝔬𝔯𝔩𝔡 𝔱𝔬 𝔰𝔢𝔢 𝔪𝔢, '𝔠𝔞𝔲𝔰𝔢 ℑ 𝔡𝔬𝔫'𝔱 𝔱𝔥𝔦𝔫𝓀 𝔱𝔥𝔞𝔱 𝔱𝔥𝔢𝓎'𝔡 𝔲𝔫𝔡𝔢𝔯𝔰𝔱𝔞𝔫𝔡",
  "ℑ 𝔴𝔞𝔫𝔱 𝔰𝔬𝔪𝔢𝔱𝔥𝔦𝔫𝔤 𝔢𝔩𝔰𝔢 𝔱𝔬 𝔤𝔢𝔱 𝔪𝔢 𝔱𝔥𝔯𝔬𝔲𝔤𝔥 𝔱𝔥𝔦𝔰 𝔰𝔢𝔪𝔦-𝔠𝔥𝔞𝔯𝔪𝔢𝔡 𝓀𝔦𝔫𝔡 𝔬𝔣 𝔩𝔦𝔣𝔢",
  "𝓐𝔫𝔡 𝔰𝔥𝔢 𝔬𝔫𝔩𝓎 𝔰𝔩𝔢𝔢𝔭𝔰 𝔴𝔥𝔢𝔫 𝔦𝔱'𝔰 𝔯𝔞𝔦𝔫𝔦𝔫' 𝔞𝔫𝔡 𝔰𝔥𝔢 𝔰𝔠𝔯𝔢𝔞𝔪𝔰 𝔞𝔫𝔡 𝔥𝔢𝔯 𝔳𝔬𝔦𝔠𝔢 𝔦𝔰 𝔰𝔱𝔯𝔞𝔦𝔫𝔦𝔫'",
  "𝓦𝔢'𝔯𝔢 𝔰𝔪𝔦𝔩𝔦𝔫𝔤, 𝔟𝔲𝔱 𝔴𝔢'𝔯𝔢 𝔠𝔩𝔬𝔰𝔢 𝔱𝔬 𝔱𝔢𝔞𝔯𝔰",
  "𝔜𝔬𝔲𝔯 𝔰𝓀𝔦𝔫 𝔞𝔫𝔡 𝔟𝔬𝔫𝔢𝔰 𝔱𝔲𝔯𝔫 𝔦𝔫𝔱𝔬 𝔰𝔬𝔪𝔢𝔱𝔥𝔦𝔫𝔤 𝔟𝔢𝔞𝔲𝔱𝔦𝔣𝔲𝔩",
  "𝕊𝔥𝔢 𝔰𝔠𝔯𝔢𝔞𝔪𝔰 𝔦𝔫 𝔰𝔦𝔩𝔢𝔫𝔠𝔢, 𝔞 𝔰𝔲𝔩𝔩𝔢𝔫 𝔯𝔦𝔬𝔱 𝔭𝔢𝔫𝔢𝔱𝔯𝔞𝔱𝔦𝔫𝔤 𝔱𝔥𝔯𝔬𝔲𝔤𝔥 𝔥𝔢𝔯 𝔪𝔦𝔫𝔡",
  "𝟙𝟟 𝔴𝔦𝔱𝔥𝔬𝔲𝔱 𝔞 𝔭𝔲𝔯𝔭𝔬𝔰𝔢 𝔬𝔯 𝔡𝔦𝔯𝔢𝔠𝔱𝔦𝔬𝔫, 𝔴𝔢 𝔡𝔬𝔫'𝔱 𝔬𝔴𝔢 𝔞𝔫𝓎𝔬𝔫𝔢 𝔞 𝔣𝔲𝔠𝓀𝔦𝔫𝔤 𝔢𝔵𝔭𝔩𝔞𝔫𝔞𝔱𝔦𝔬𝔫",
  "𝕊𝔬 𝔞𝔪 ℑ 𝔰𝔱𝔦𝔩𝔩 𝔴𝔞𝔦𝔱𝔦𝔫𝔤 𝔣𝔬𝔯 𝔱𝔥𝔦𝔰 𝔴𝔬𝔯𝔩𝔡 𝔱𝔬 𝔰𝔱𝔬𝔭 𝔥𝔞𝔱𝔦𝔫𝔤?",
  "𝓦𝔢 𝔠𝔬𝔲𝔩𝔡 𝔩𝔢𝔞𝔳𝔢 𝔱𝔥𝔦𝔰 𝔱𝔬𝔴𝔫 𝔞𝔫𝔡 𝔯𝔲𝔫 𝔣𝔬𝔯𝔢𝔳𝔢𝔯, 𝔩𝔢𝔱 𝓎𝔬𝔲𝔯 𝔴𝔞𝔳𝔢𝔰 𝔠𝔯𝔞𝔰𝔥 𝔡𝔬𝔴𝔫 𝔬𝔫 𝔪𝔢 𝔞𝔫𝔡 𝔱𝔞𝓀𝔢 𝔪𝔢 𝔞𝔴𝔞𝓎",
  "𝓦𝔥𝔢𝔫 𝓎𝔬𝔲 𝔰𝔢𝔢 𝔪𝓎 𝔣𝔞𝔠𝔢 𝔥𝔬𝔭𝔢 𝔦𝔱 𝔤𝔦𝔳𝔢𝔰 𝓎𝔬𝔲 𝔥𝔢𝔩𝔩, 𝔥𝔬𝔭𝔢 𝔦𝔱 𝔤𝔦𝔳𝔢𝔰 𝓎𝔬𝔲 𝔥𝔢𝔩𝔩",
  "𝔇𝔬 𝓎𝔬𝔲 𝔢𝔳𝔢𝔯 𝔣𝔢𝔢𝔩 𝔩𝔦𝓀𝔢 𝔟𝔯𝔢𝔞𝓀𝔦𝔫' 𝔡𝔬𝔴𝔫? 𝔇𝔬 𝓎𝔬𝔲 𝔢𝔳𝔢𝔯 𝔣𝔢𝔢𝔩 𝔬𝔲𝔱 𝔬𝔣 𝔭𝔩𝔞𝔠𝔢?", 
  "𝔑𝔬𝔟𝔬𝔡𝓎 𝔠𝔞𝔯𝔢𝔰 '𝔠𝔞𝔲𝔰𝔢 ℑ'𝔪 𝔞𝔩𝔬𝔫𝔢 𝔞𝔫𝔡 𝔱𝔥𝔢 𝔴𝔬𝔯𝔩𝔡 𝔦𝔰 𝔥𝔞𝔳𝔦𝔫𝔤 𝔪𝔬𝔯𝔢 𝔣𝔲𝔫 𝔱𝔥𝔞𝔫 𝔪𝔢 𝔱𝔬𝔫𝔦𝔤𝔥𝔱", 
  "𝔑𝔬𝔴 𝔦𝔱'𝔰 𝔧𝔲𝔰𝔱 𝔱𝔬𝔬 𝔩𝔞𝔱𝔢, 𝔞𝔫𝔡 𝔴𝔢 𝔠𝔞𝔫'𝔱 𝔤𝔬 𝔟𝔞𝔠𝓀, ℑ'𝔪 𝔰𝔬𝔯𝔯𝓎 ℑ 𝔠𝔞𝔫'𝔱 𝔟𝔢 𝔭𝔢𝔯𝔣𝔢𝔠𝔱"
];

async function emojiString(amount) {
    let run = getRandomInt(amount);
    let output = [''];
    for (let i = 0; i < run; i++){
      output.push(emoji[getRandomInt(emoji.length)]);
    }
    return output;
  }

async function msn(channel, tags, message, client, ComfyDB){
  let randomLyric = song[getRandomInt(song.length)];
  let randomBonus = bonus[getRandomInt(bonus.length)];
  let emotes = await emojiString(7);

  let chance = getRandomInt(10);
  let bonusString = '';
  if (chance === 7) bonusString = randomBonus;
  let final = gothic(bonusString + emotes.join('') + randomLyric + emotes.reverse().join('') + bonusString);

  return final;
};

module.exports = msn;

